backend/controllers/ContentController.php

SELECT * FROM `content` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Content::findOne($id)) !== null) {