frontend/controllers/ContentController.php

SELECT * FROM `content` WHERE `url`='kuznechik/'
---
    protected function findModel($url)
    {

        $valid_url = $this->ValidateUrl($url);

        if (($model = Content::findOne(['url'=>$valid_url])) !== null) {