backend/models/Content.php

SELECT * FROM `user` WHERE `id`=2
---
    public function GetUserName($id) {
        $user = User::findOne($id);

SELECT * FROM `user`
---
    public function GetListAuthors() {
        $users = User::find()->all();