frontend/models/Content.php

SELECT * FROM `user` WHERE `id`=2
---
    public function GetAuthorName($id) {

        $user = User::findOne($id);

SELECT * FROM `content`
---
    public static function GetElementOnMenu() {
        $contents = self::find()->all();